-- For Localization

ITEM_FUEL = "Горючее"
ITEM_FUEL_FULL_USE = "Канистра топлива"
ITEM_BOLTS = "Болты"
ITEM_NUTS = "Гайки"
ITEM_PARTS = "Металлические запчасти"
ITEM_LUMP = "Лампа накаливания"
ITEM_FULLMASTER = "Набор напильников «FullMaster»"
ITEM_DRILL = "Дрель"
ITEM_SCREWS = "Саморезы"
ITEM_NAILS = "Гвозди"
ITEM_SCREW = "Отвертка"
ITEM_ROULET = "Рулетка"
ITEM_PENA = "Монтажная пена"
ITEM_ELECTRONICS = "Электроника"
ITEM_ELECTRONICS_USE = "Высокотехнологичная электроника"
ITEM_MACHINERY = "Раб. оборудование"
ITEM_MACHINERY_USE = "Ул. оборудование"
ITEM_BOOKS = "Книги"
ITEM_BOTLES = "Бутылки"
ITEM_DETAILS = "Детали"
ITEM_ANANAGA = "Ананага"
ITEM_ROLEX = "Золотые часы"
ITEM_CHAIN_GOLD = "Золотая цепочка"
ITEM_SKULLRING = "Золотое кольцо с черепом"
ITEM_VITALIK = "Кувалда «Vitalik»"
ITEM_HANDRILL = "Ручная дрель"
ITEM_METALSCISSORS = "Ножницы для резки металла"
ITEM_HOSE = "Гофрированный шланг"
ITEM_KEK = "Лента «KEK»"
ITEM_TOOLSET = "Набор инструментов"
ITEM_ELECTRONICS_COMPONENTS = "Компоненты электроники"
ITEM_WIRES = "Провода"
ITEM_NIPPERS = "Кусачки"
ITEM_PLIERS_ROUND = "Круглогубцы"
ITEM_SVECH = "Свеча зажигания"
ITEM_ENGINE = "Двигатель"
ITEM_DOSKI = "Доски"
ITEM_OIL = "Нефть"
ITEM_OIL_USE = "Бочка с топливом"
GIVE_100000_MONEY = "Передать @fff3e5cb100.000 монет"
ITEM_RELE = "Реле"
ITEM_BULDEX = "Кабелерез «Bulbex»"
ITEM_BP = "Блок питания"
ITEM_MILITARY_CABLE = "Военный кабель"
ITEM_PLATE = "Плата"
ITEM_CONVERTER = "Передовой преобразователь тока"
GIVE_1000000_MONEY = "Передать @fff3e5cb1.000.000 монет"
ITEM_ENERGO_LUMP = "Энергосберегающая лампа"
GIVE_50000_MONEY = "Передать @fff3e5cb50.000 монет"
ITEM_CABLE = "Силовой кабель"
ITEM_PIPE_WRENCH = "Шарнирный ключ «КШС»"
ITEM_FITANYASHKA = "Дакимакура FitaNyashka"
ITEM_KAKTUS = "Кактус"
GIVE_500000_MONEY = "Передать @fff3e5cb500.000 монет"
ITEM_THERMOMETER = "Термометр"
ITEM_MILITARY_PLATE = "Военная плата"
ITEM_COOLER = "Кулер"
ITEM_MANUAL = "Мануал"
ITEM_PLIERS = "Плоскогубцы"
ITEM_SCREW_FLAT_LONG = "Отвертка плоская длинная"
ITEM_FIREWOOD = "Дрова"
ITEM_CHRISTMAS_BALL_BLUE = "Синий шар"
ITEM_CHRISTMAS_BALL_RED = "Красный шар"
ITEM_CHRISTMAS_BALL_WHITE = "Белый шар"
ITEM_CHRISTMAS_STAR = "Рождественская звезда"

MSG_RAID = "Рейд №"
MSG_DAY = "День: "
MSG_PMC = "Оператор ЧВК "
MSG_MAP_R1M1 = "Край"
MSG_MAP_R5M1 = "Лес"

MSG_EXIT1 = "@ffffffffВЫХОД01 "
MSG_EXIT2 = "@ffffffffВЫХОД02 "
MSG_EXIT3 = "@ffffffffВЫХОД03 "

EXITSCAV_FACTORYGATE = "@ffd1d3d4Ворота завода"
EXITSCAV_OLDDEPO = "@ffd1d3d4Старое депо"
EXITSCAV_SOUTHPOST = "@ffd1d3d4Южный пост ООН"
EXITSCAV_TOR1M1 = "@ffd1d3d4Блокпост ВС РФ"
EXITSCAV_EASTERNCLIFFS = "@ffd1d3d4Восточные скалы"
EXITSCAV_MOUNTAINCACHE = "@ffd1d3d4Горный тайник"
EXITSCAV_SCAVBRIGE = "@ffd1d3d4Дикий мост"
EXITSCAV_BOAT = "@ffd1d3d4Лодка"
EXITSCAV_SHELTER = "@ffd1d3d4Убежище мертвеца"
EXITSCAV_SCAVHOME = "@ffd1d3d4Изба Диких"
EXITSCAV_OUTSKIRTS = "@ffd1d3d4Окраины"
EXITSCAV_SCAVBUNKER = "@ffd1d3d4Бункер Диких"

-- Генерация случайного имени для дикого
function GenerateRandomScavName()
	local firstName = {"Иван", "Дмитрий", "Дима", "Димка", "Айвен", "Айваныч", "Бен", "Виталий", "Виталик", "Виталя", "Вася", "Пися", "Максим", "Ашот", "Федя", "Фердинанд", "Саня", "Санька", "Илья", "Илюха", "Леха", "Петька", "Савелий", "Валерий", "Киса", "Кот", "Дед", "Мошенник", "Папич", "Павел", "Павлик", "Витёк", "Вантуз", "Даня", "Данила", "Димон", "Кирюха", "Боря", "Борис", "Кабан", "Макс", "Карсен", "Алик", "Пашка", "Вован", "Анатолий", "Стёпа", "Мыш", "Муж", "Аксель", "Феликс", "Вор", "Дик", "Миха", "Михаил", "Ростислав", "Колян", "Коля", "Ёбырь", "Игрок", "Пётр", "Петруха", "Дод", "Петрович", "Алекс", "Алексей", "Сергей", "Серёга", "Серго", "Гном", "Друид", "Бандит", "Бродяга", "Кочевник", "Работяга", "Америго", "Сэм", "Конни", "Блайд", "Дронн", "Серый", "Талик", "Гит", "Святослав", "Мистер", "Кот", "Санёк", "Тим", "Мишаня", "Фёдор", "Васян", "Никита", "Никитка", "Монолит", "Станислав", "Стас", "Стасян", "Стакан"}
	local secondName = {"Слабый", "Сильный", "Мощный", "Меткий", "Скорострел", "Железный", "Бронированный", "Неудачник", "Наркоман", "Белазист", "Натурал", "РПГ", "Гусак", "Дикарь", "Сметана", "Базированный", "Программист", "Айтишник", "Опасный", "Страшный", "Крепкий", "Улучшенный", "Апгрейднутый", "Моряк", "Ебанько", "Герой", "Новичок", "Бывалый", "Профи", "Мастер", "Водила", "Ананага", "Бобёр", "Вертухай", "Заднеприводный", "Мрачный", "Киберпсих", "Киберспортсмен", "Торговец", "Бармен", "Оракул", "Наркоторговец", "Ненаркоторговец", "Наркоман", "Кепка", "Кепарик", "Рыхлый", "Казах", "Самурай", "Япончик", "Пончик", "Сладкий", "Ботан", "Сфено", "Затвор", "Помощник", "Кусок", "Спрут", "Рейнметалл", "Фагот", "Скоростной", "Яйцо", "Упитыш", "Крепыш", "Клоун", "Бебра", "Яебу", "Правильный", "ЧСВ", "Полторашка", "Бигмак", "Микрофон", "Вибрирующий", "Разрядник", "Няшка", "Меченый", "Пух", "Мозголюб", "Левый", "Правый", "Фермер", "Мокрый", "Влажный", "Наглый", "Глушитель", "Чарли", "Капец", "Пиздюк", "Гондурас", "Овощебаза", "Сиська", "Компатчер", "Шиза", "Обезьяна", "Дристомёт", "Иваныч", "Иванов", "Барыга", "Одноглазый", "Ебучий", "Везунчик", "Крипто", "Мякиш", "Махинист", "Го", "Дроссель", "Идёт", "Замузик", "Крутой", "Любитель", "Поедатель", "Предатель", "Белаз", "Скаут", "Боец", "Таракан", "Клоп", "Муравей", "Медведь", "Охотник", "Урал", "Сагитта", "Филимон", "Отверствие", "Скорб", "Казино", "Генератор", "Терминатор", "Странник", "Младший", "Старший", "Бензобак", "Грузин", "Дырявый", "Снайпер", "Крип", "Крипто", "Грустный", "Шляпа", "Заводской", "Паштет", "Арахис", "Умник", "Дотер", "Буянов", "Мудрый", "Долбоящер", "Солевой", "Питерский", "Сосиска", "Нежный"}
	local Name = ""..firstName[random(getn(firstName))].." "..secondName[random(getn(secondName))]..""

	return Name
end










